SEEDED_FACULTIES = [
    {"faculty_id": "F01", "name": "Факультет біології, географії та екології"},
    {"faculty_id": "F02", "name": "Педагогічний факультет"},
    {"faculty_id": "F03", "name": "Факультет бізнесу і права"},
    {"faculty_id": "F04", "name": "Факультет української й іноземної філології, журналістики та мистецтв"},
    {"faculty_id": "F05", "name": "Медичний факультет"},
    {"faculty_id": "F06", "name": "Факультет психології, історії та соціології"},
    {"faculty_id": "F07", "name": "Факультет комп'ютерних наук, фізики та математики"},
    {"faculty_id": "F08", "name": "Факультет фізичного виховання та спорту"},
]

SEEDED_DEPARTMENTS = [
    {"department_id": "D001", "faculty_id": "F07", "name": "Кафедра алгебри, геометрії та математичного аналізу"},
    {"department_id": "D002", "faculty_id": "F07", "name": "Кафедра фізики"},
    {"department_id": "D003", "faculty_id": "F07", "name": "Кафедра комп'ютерних наук та програмної інженерії"},

    {"department_id": "D004", "faculty_id": "F08", "name": "Кафедра теорії та методики фізичного виховання"},
    {"department_id": "D005", "faculty_id": "F08", "name": "Кафедра олімпійського та професійного спорту"},

    {"department_id": "D006", "faculty_id": "F03", "name": "Кафедра готельно-ресторанного та туристичного бізнесу"},
    {"department_id": "D007", "faculty_id": "F03", "name": "Кафедра економіки, менеджменту та адміністрування"},
    {"department_id": "D008", "faculty_id": "F03", "name": "Кафедра національного, міжнародного права та правоохоронної діяльності"},
    {"department_id": "D009", "faculty_id": "F03", "name": "Кафедра фінансів, обліку та підприємництва"},

    {"department_id": "D010", "faculty_id": "F02", "name": "Кафедра педагогіки та психології дошкільної та початкової освіти"},
    {"department_id": "D011", "faculty_id": "F02", "name": "Кафедра теорії та методики дошкільної та початкової освіти"},
    {"department_id": "D012", "faculty_id": "F02", "name": "Кафедра спеціальної освіти"},
    {"department_id": "D013", "faculty_id": "F02", "name": "Кафедра педагогіки, психології й освітнього менеджменту імені проф. Є. Петухова"},

    {"department_id": "D014", "faculty_id": "F05", "name": "Кафедра медицини"},
    {"department_id": "D015", "faculty_id": "F05", "name": "Кафедра хімії та фармації"},
    {"department_id": "D016", "faculty_id": "F05", "name": "Кафедра фізичної терапії та ерготерапії"},

    {"department_id": "D017", "faculty_id": "F06", "name": "Кафедра психології"},
    {"department_id": "D018", "faculty_id": "F06", "name": "Кафедра філософії, соціології та соціальної роботи"},
    {"department_id": "D019", "faculty_id": "F06", "name": "Кафедра історії, археології та методики викладання"},

    {"department_id": "D020", "faculty_id": "F01", "name": "Кафедра географії та екології"},
    {"department_id": "D021", "faculty_id": "F01", "name": "Кафедра біології людини та імунології"},
]
